app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(school_params(:title, :room_number))
        @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Gym Class"], ["room_number", 101]]